Examinator/src/InformationRegisters/АвтоРазделыФорумаСУО/АвтоРазделыФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтоРазделыФорумаСУО</name>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/АвтоРазделыФорумаСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция РазделыПользователя(Знач Пользователь = Неопределено, Знач Раздел = Неопределено, ПроверитьНаличие=Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоРазделыФорумаСУО.Раздел КАК Ссылка,
		|	АвтоРазделыФорумаСУО.Наименование КАК Наименование,
		|	ТИПЗНАЧЕНИЯ(АвтоРазделыФорумаСУО.Раздел) КАК ТипРаздела,
		|	АвтоРазделыФорумаСУО.Пользователь
		|ИЗ
		|	РегистрСведений.АвтоРазделыФорумаСУО КАК АвтоРазделыФорумаСУО";
		
		
	Если Раздел <> Неопределено ИЛИ Пользователь <> Неопределено Тогда 
		Запрос.Текст = Запрос.Текст + " ГДЕ ";
	КонецЕсли;
		
	Если Раздел <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " АвтоРазделыФорумаСУО.Раздел = &Раздел И";
		Запрос.УстановитьПараметр("Раздел", Раздел);
	КонецЕсли;
		
	Если Пользователь <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " АвтоРазделыФорумаСУО.Пользователь = &Пользователь И";
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
	КонецЕсли;
	
	Если Раздел <> Неопределено ИЛИ Пользователь <> Неопределено Тогда 
		Запрос.Текст = Сред(Запрос.Текст, 1, СтрДлина(Запрос.Текст)-1); // Убираем И
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Результат = Запрос.Выполнить();

	Если ПроверитьНаличие Тогда
		
		Возврат НЕ Результат.Пустой(); 
		
	Иначе
		
		Возврат Результат.Выгрузить();	
		
	КонецЕсли;
		
КонецФункции

Процедура ДобавитьАвтоРаздел(Пользователь, Раздел, НаименованиеРаздела) Экспорт
	
	НаборЗаписей = РегистрыСведений.АвтоРазделыФорумаСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Раздел.Установить(Раздел);
		
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.Раздел       = Раздел;
	НоваяЗапись.Наименование = НаименованиеРаздела;

	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьАвтоРаздел(Пользователь, Раздел) Экспорт
	
	НаборЗаписей = РегистрыСведений.АвтоРазделыФорумаСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Раздел.Установить(Раздел);

	НаборЗаписей.Записать();	
	
КонецПроцедуры

#КонецЕсли
